# Tidyverse: Data Wrangling

## 1. Introduction

### 1.1. Tidyverse
This topic introduces the [`tidyverse`] library, which is a collection of R packages desgined for Data Science. `library(tidyverse)` will load the following core packages:
- `ggplot2` for data visualization,
- `dplyr` for data manipulation,
- `tidyr` for data tidying,
- `readr` for data import,
- `purrr` for functional programming,
- `tibble` for tibbles, a modern re-imagining of data frames,
- `stringr` for strings,
- `forcats` for factors.

Tidyverse also includes many other useful packages such as `lubridate` and `magrittr`, however each of them need to be loaded separately.

[`tidyverse`]: https://www.tidyverse.org/packages/

In [1]:
library(tidyverse)

Warning message:
"package 'tidyverse' was built under R version 3.6.3"
-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

v ggplot2 3.3.2     v purrr   0.3.4
v tibble  3.0.1     v dplyr   1.0.0
v tidyr   1.1.0     v stringr 1.4.0
v readr   1.3.1     v forcats 0.5.0

Warning message:
"package 'ggplot2' was built under R version 3.6.3"
Warning message:
"package 'tibble' was built under R version 3.6.3"
Warning message:
"package 'tidyr' was built under R version 3.6.3"
Warning message:
"package 'readr' was built under R version 3.6.3"
Warning message:
"package 'purrr' was built under R version 3.6.3"
Warning message:
"package 'dplyr' was built under R version 3.6.3"
Warning message:
"package 'forcats' was built under R version 3.6.3"
-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

### 1.2. The pipe
The pipe `%>%` from the `magrittr` library provides a brand new way writing functions. It uses an object as the first argument of a function, allowing you to read code from left to right insted of from inside to outside. Packages in Tidyverse automatically load the pipe for you, so it's not required to use `magrittr` explicitly.

In [ ]:
library(magrittr)

In [3]:
floor(sqrt(15))

[1] 3

In [4]:
15 %>% sqrt %>% floor

[1] 3

## 2. Data exploring

### 2.1. Analysis of observations

In [5]:
library(dplyr)

In [6]:
mtcars <- read.csv('../data/mtcars.csv')

#### Top and bottom rows

In [7]:
mtcars %>% head

  model             mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
4 Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
5 Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
6 Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

In [8]:
mtcars %>% tail(3)

   model         mpg  cyl disp hp  drat wt   qsec vs am gear carb
30 Ferrari Dino  19.7 6   145  175 3.62 2.77 15.5 0  1  5    6
31 Maserati Bora 15.0 8   301  335 3.54 3.57 14.6 0  1  5    8
32 Volvo 142E    21.4 4   121  109 4.11 2.78 18.6 1  1  4    2

#### Slicing specific rows

In [9]:
mtcars %>% slice(1:3, 6)

  model         mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Mazda RX4     21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 Mazda RX4 Wag 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 Datsun 710    22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
4 Valiant       18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

### 1.2. Analysis of attributes

In [10]:
library(dplyr)

In [11]:
mtcars <- read.csv('../data/mtcars.csv')

In [12]:
mtcars %>% names

 [1] "model" "mpg"   "cyl"   "disp"  "hp"    "drat"  "wt"    "qsec"  "vs"
[10] "am"    "gear"  "carb"

In [13]:
mtcars %>% dim

[1] 32 12

#### Selecting columns
You can either select columns in a dataframe using their names or their indices.

In [14]:
mtcars$model

 [1] Mazda RX4           Mazda RX4 Wag       Datsun 710
 [4] Hornet 4 Drive      Hornet Sportabout   Valiant
 [7] Duster 360          Merc 240D           Merc 230
[10] Merc 280            Merc 280C           Merc 450SE
[13] Merc 450SL          Merc 450SLC         Cadillac Fleetwood
[16] Lincoln Continental Chrysler Imperial   Fiat 128
[19] Honda Civic         Toyota Corolla      Toyota Corona
[22] Dodge Challenger    AMC Javelin         Camaro Z28
[25] Pontiac Firebird    Fiat X1-9           Porsche 914-2
[28] Lotus Europa        Ford Pantera L      Ferrari Dino
[31] Maserati Bora       Volvo 142E
32 Levels: AMC Javelin Cadillac Fleetwood Camaro Z28 ... Volvo 142E

In [15]:
# selecting specific columns
mtcars %>% select(model:cyl, gear) %>% head(3)

  model         mpg  cyl gear
1 Mazda RX4     21.0 6   4
2 Mazda RX4 Wag 21.0 6   4
3 Datsun 710    22.8 4   4

In [16]:
# selecting specific columns
mtcars %>% select(1:5, gear) %>% head

  model             mpg  cyl disp hp  gear
1 Mazda RX4         21.0 6   160  110 4
2 Mazda RX4 Wag     21.0 6   160  110 4
3 Datsun 710        22.8 4   108   93 4
4 Hornet 4 Drive    21.4 6   258  110 3
5 Hornet Sportabout 18.7 8   360  175 3
6 Valiant           18.1 6   225  105 3

#### Unique values

In [17]:
mtcars %>% select(cyl) %>% unique %>% arrange(cyl)

  cyl
1 4
2 6
3 8

In [18]:
mtcars %>% select(cyl, am) %>% unique %>% arrange(am, cyl)

  cyl am
1 4   0
2 6   0
3 8   0
4 4   1
5 6   1
6 8   1

### 1.3. Basic statistics

In [19]:
library(dplyr)

In [20]:
mtcars <- read.csv('../data/mtcars.csv')

In [21]:
mtcars %>% select(2:5) %>% summary

      mpg             cyl             disp             hp
 Min.   :10.40   Min.   :4.000   Min.   : 71.1   Min.   : 52.0
 1st Qu.:15.43   1st Qu.:4.000   1st Qu.:120.8   1st Qu.: 96.5
 Median :19.20   Median :6.000   Median :196.3   Median :123.0
 Mean   :20.09   Mean   :6.188   Mean   :230.7   Mean   :146.7
 3rd Qu.:22.80   3rd Qu.:8.000   3rd Qu.:326.0   3rd Qu.:180.0
 Max.   :33.90   Max.   :8.000   Max.   :472.0   Max.   :335.0

In [22]:
mtcars$mpg %>% mean

[1] 20.09062

In [23]:
mtcars$mpg %>% quantile

    0%    25%    50%    75%   100%
10.400 15.425 19.200 22.800 33.900

The `describe()` function from the `Hmisc` library provides even more details about each column.

In [ ]:
Hmisc::describe(mtcars$mpg)

In [ ]:
Hmisc::describe(mtcars$model)

### 1.4. Sorting and filtering

In [28]:
library(dplyr)

In [29]:
mtcars <- read.csv('../data/mtcars.csv')

#### Sorting

In [30]:
mtcars %>% arrange(cyl, mpg) %>% head

  model         mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
1 Volvo 142E    21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2
2 Toyota Corona 21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
3 Datsun 710    22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
4 Merc 230      22.8 4   140.8  95 3.92 3.150 22.90 1  0  4    2
5 Merc 240D     24.4 4   146.7  62 3.69 3.190 20.00 1  0  4    2
6 Porsche 914-2 26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2

In [31]:
mtcars %>% arrange(cyl, desc(mpg)) %>% head

  model          mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
1 Toyota Corolla 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
2 Fiat 128       32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
3 Honda Civic    30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
4 Lotus Europa   30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
5 Fiat X1-9      27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
6 Porsche 914-2  26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2

In [32]:
mtcars %>% arrange(desc(cyl, mpg)) %>% head

  model              mpg  cyl disp  hp  drat wt   qsec  vs am gear carb
1 Hornet Sportabout  18.7 8   360.0 175 3.15 3.44 17.02 0  0  3    2
2 Duster 360         14.3 8   360.0 245 3.21 3.57 15.84 0  0  3    4
3 Merc 450SE         16.4 8   275.8 180 3.07 4.07 17.40 0  0  3    3
4 Merc 450SL         17.3 8   275.8 180 3.07 3.73 17.60 0  0  3    3
5 Merc 450SLC        15.2 8   275.8 180 3.07 3.78 18.00 0  0  3    3
6 Cadillac Fleetwood 10.4 8   472.0 205 2.93 5.25 17.98 0  0  3    4

#### Filtering data

In [33]:
mtcars %>% filter(mpg>=30)

  model          mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Fiat 128       32.4 4   78.7  66 4.08 2.200 19.47 1  1  4    1
2 Honda Civic    30.4 4   75.7  52 4.93 1.615 18.52 1  1  4    2
3 Toyota Corolla 33.9 4   71.1  65 4.22 1.835 19.90 1  1  4    1
4 Lotus Europa   30.4 4   95.1 113 3.77 1.513 16.90 1  1  5    2

In [34]:
mtcars %>% filter(mpg>=30 & carb==2)

  model        mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Honda Civic  30.4 4   75.7  52 4.93 1.615 18.52 1  1  4    2
2 Lotus Europa 30.4 4   95.1 113 3.77 1.513 16.90 1  1  5    2

In [35]:
mtcars %>% filter(mpg>=30 | disp<=90)

  model          mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Fiat 128       32.4 4   78.7  66 4.08 2.200 19.47 1  1  4    1
2 Honda Civic    30.4 4   75.7  52 4.93 1.615 18.52 1  1  4    2
3 Toyota Corolla 33.9 4   71.1  65 4.22 1.835 19.90 1  1  4    1
4 Fiat X1-9      27.3 4   79.0  66 4.08 1.935 18.90 1  1  4    1
5 Lotus Europa   30.4 4   95.1 113 3.77 1.513 16.90 1  1  5    2

In [36]:
mtcars %>% 
    filter(disp>300) %>% 
    filter(cyl==6 | cyl==8)

   model               mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1  Hornet Sportabout   18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
2  Duster 360          14.3 8   360  245 3.21 3.570 15.84 0  0  3    4
3  Cadillac Fleetwood  10.4 8   472  205 2.93 5.250 17.98 0  0  3    4
4  Lincoln Continental 10.4 8   460  215 3.00 5.424 17.82 0  0  3    4
5  Chrysler Imperial   14.7 8   440  230 3.23 5.345 17.42 0  0  3    4
6  Dodge Challenger    15.5 8   318  150 2.76 3.520 16.87 0  0  3    2
7  AMC Javelin         15.2 8   304  150 3.15 3.435 17.30 0  0  3    2
8  Camaro Z28          13.3 8   350  245 3.73 3.840 15.41 0  0  3    4
9  Pontiac Firebird    19.2 8   400  175 3.08 3.845 17.05 0  0  3    2
10 Ford Pantera L      15.8 8   351  264 4.22 3.170 14.50 0  1  5    4
11 Maserati Bora       15.0 8   301  335 3.54 3.570 14.60 0  1  5    8

### 1.5. Adding columns

In [37]:
library(dplyr)

In [38]:
mtcars <- read.csv('../data/mtcars.csv')

In [39]:
mtcars %>% mutate(new=0) %>% head

  model             mpg  cyl disp hp  drat wt    qsec  vs am gear carb new
1 Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4    0
2 Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4    0
3 Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1    0
4 Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1    0
5 Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2    0
6 Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1    0

In [40]:
mtcars %>% mutate(new1=gear+carb, new2='nothing') %>% head

  model             mpg  cyl disp hp  drat wt    qsec  vs am gear carb new1
1 Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4    8
2 Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4    8
3 Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1    5
4 Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1    4
5 Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2    5
6 Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1    4
  new2
1 nothing
2 nothing
3 nothing
4 nothing
5 nothing
6 nothing

In [41]:
# mutate with case/when
df <- data.frame(number=1:10)
df %>%
    mutate(
        group = case_when(
            number<=5 ~ 'group 1',
            number>5 & number<8 ~ 'group 2',
            TRUE ~ 'group 3'))

   number group
1   1     group 1
2   2     group 1
3   3     group 1
4   4     group 1
5   5     group 1
6   6     group 2
7   7     group 2
8   8     group 3
9   9     group 3
10 10     group 3

## 2. Data tidying

### 2.1. Data aggregation

In [42]:
library(dplyr)

#### Basic grouping

In [43]:
fish <- read.csv('../data/us_fishery_foreign_trade.csv')
fish %>% head

  year month product         country              value feature      unit
1 2010 1     SABLEFISH FRESH UNITED ARAB EMIRATES  2297 EXP Quantity kg
2 2010 1     SABLEFISH FRESH JAPAN                16025 EXP Quantity kg
3 2010 1     SABLEFISH FRESH JAPAN                63437 EXP Quantity kg
4 2010 1     MONKFISH FRESH  CANADA                 579 EXP Quantity kg
5 2010 1     MONKFISH FRESH  CANADA                7975 EXP Quantity kg
6 2010 1     MONKFISH FRESH  NETHERLANDS            389 EXP Quantity kg

In [44]:
fish %>% group_by(feature) %>% summarise(mean_value=mean(value))

`summarise()` ungrouping output (override with `.groups` argument)

  feature      mean_value
1 EXP Quantity  38093.38
2 EXP Value    273375.80
3 IMP Quantity  28478.83
4 IMP Value    215764.03

In [45]:
# number of rows each group
fish %>%
    group_by(feature, unit) %>%
    summarise(count=n(), sum_value=sum(value))

`summarise()` regrouping output by 'feature' (override with `.groups` argument)

  feature      unit count sum_value
1 EXP Quantity kg   4007   152640167
2 EXP Value    USD  4007  1095416826
3 IMP Quantity kg   4730   134704872
4 IMP Value    USD  4730  1020563847

#### Advanced grouping

In [46]:
mtcars <- read.csv('../data/mtcars.csv')
mtcars %>% head

  model             mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
4 Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
5 Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
6 Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

In [47]:
# get the ranks for each group
mtcars %>%
    select(vs, mpg) %>%
    group_by(vs) %>%
    mutate(rank_mpg=dense_rank(mpg)) %>%
    arrange(vs, mpg)

   vs mpg  rank_mpg
1  0  10.4  1
2  0  10.4  1
3  0  13.3  2
4  0  14.3  3
5  0  14.7  4
6  0  15.0  5
7  0  15.2  6
8  0  15.2  6
9  0  15.5  7
10 0  15.8  8
11 0  16.4  9
12 0  17.3 10
13 0  18.7 11
14 0  19.2 12
15 0  19.7 13
16 0  21.0 14
17 0  21.0 14
18 0  26.0 15
19 1  17.8  1
20 1  18.1  2
21 1  19.2  3
22 1  21.4  4
23 1  21.4  4
24 1  21.5  5
25 1  22.8  6
26 1  22.8  6
27 1  24.4  7
28 1  27.3  8
29 1  30.4  9
30 1  30.4  9
31 1  32.4 10
32 1  33.9 11

In [48]:
# apply functions to multiple variables
mtcars %>%
    group_by(vs) %>%
    summarise_at(
        vars(mpg, hp),
        funs(mean, max, min))

Warning message:
"`funs()` is deprecated as of dplyr 0.8.0.
Please use a list of either functions or lambdas:

  # Simple named list:
  list(mean = mean, median = median)

  # Auto named with `tibble::lst()`:
  tibble::lst(mean, median)

  # Using lambdas
  list(~ mean(., trim = .2), ~ median(., na.rm = TRUE))
This warning is displayed once every 8 hours.
Call `lifecycle::last_warnings()` to see where this warning was generated."

  vs mpg_mean hp_mean   mpg_max hp_max mpg_min hp_min
1 0  16.61667 189.72222 26.0    335    10.4    91
2 1  24.55714  91.35714 33.9    123    17.8    52

In [49]:
# apply fucntions to variables that meets a given condition
mtcars %>%
    select(vs, mpg, hp, cyl) %>%
    mutate(cyl = as.factor(cyl)) %>% 
    group_by(vs) %>%
    summarise_if(
        is.numeric,
        funs(mean, median))

  vs mpg_mean hp_mean   mpg_median hp_median
1 0  16.61667 189.72222 15.65      180
2 1  24.55714  91.35714 22.80       96

### 2.2. Unpivoting

In [50]:
library(tidyr)

In [51]:
wide = data.frame(
    Color= c('Red', 'Green', 'Blue'),
    'Q1.2020'=c(1000, 1500, 2000),
    'Q2.2020'=c(1200, 1500, 2200),
    'Q3.2020'=c(1500, 1575, 2000),
    'Q4.2020'=c(1700, 1800, 2800)
)
wide

  Color Q1.2020 Q2.2020 Q3.2020 Q4.2020
1 Red   1000    1200    1500    1700
2 Green 1500    1500    1575    1800
3 Blue  2000    2200    2000    2800

In [52]:
wide %>% pivot_longer(
    cols=c(Q1.2020, Q2.2020, Q3.2020, Q4.2020),
    names_to='Quarter',
    values_to='Sales')

   Color Quarter Sales
1  Red   Q1.2020 1000
2  Red   Q2.2020 1200
3  Red   Q3.2020 1500
4  Red   Q4.2020 1700
5  Green Q1.2020 1500
6  Green Q2.2020 1500
7  Green Q3.2020 1575
8  Green Q4.2020 1800
9  Blue  Q1.2020 2000
10 Blue  Q2.2020 2200
11 Blue  Q3.2020 2000
12 Blue  Q4.2020 2800

### 2.3. Pivot table

In [53]:
library(tidyr)

In [54]:
long = data.frame(
    Market=c('Asian', 'Asian', 'Asian', 'Asian', 'Europe', 'Europe', 'Europe', 'Europe'),
    Color=c('Red', 'Red', 'Blue', 'Blue', 'Red', 'Red', 'Blue', 'Blue'),
    Size=c('Large', 'Small', 'Large', 'Small','Large', 'Small', 'Large', 'Small'),
    Price=c(17, 11, 19, 13, 18, 12, 20, 14),
    Sales=c(68000, 44000, 57000, 52000, 81000, 72000, 90000, 77000)
)
long

  Market Color Size  Price Sales
1 Asian  Red   Large 17    68000
2 Asian  Red   Small 11    44000
3 Asian  Blue  Large 19    57000
4 Asian  Blue  Small 13    52000
5 Europe Red   Large 18    81000
6 Europe Red   Small 12    72000
7 Europe Blue  Large 20    90000
8 Europe Blue  Small 14    77000

In [55]:
long %>% pivot_wider(
    id_cols=c('Market', 'Color'),
    names_from='Size',
    values_from='Sales'
)

  Market Color Large Small
1 Asian  Red   68000 44000
2 Asian  Blue  57000 52000
3 Europe Red   81000 72000
4 Europe Blue  90000 77000

In [56]:
long %>% pivot_wider(
    id_cols='Market',
    names_from='Size',
    values_from='Price',
    values_fn=mean
)

  Market Large Small
1 Asian  18    12
2 Europe 19    13

In [57]:
long %>% pivot_wider(
    id_cols='Market',
    names_from='Size',
    values_from=c('Sales', 'Price'),
    values_fn=list('Sales'=sum, 'Price'=mean)
)

  Market Sales_Large Sales_Small Price_Large Price_Small
1 Asian  125000       96000      18          12
2 Europe 171000      149000      19          13

### 2.4. Appending data

In [58]:
library(dplyr)
library(readxl)

Warning message:
"package 'readxl' was built under R version 3.6.3"

In [59]:
# remove all warnings
options(warn=-1)

In [60]:
path = '../data/world_population.xlsx'
sheets = excel_sheets(path)
sheets

[1] "1960s" "1970s" "1980s" "1990s" "2000s" "2010s"

In [61]:
world1 = read_excel(path, sheet=sheets[1])
world2 = read_excel(path, sheet=sheets[2])
world3 = read_excel(path, sheet=sheets[3])
world4 = read_excel(path, sheet=sheets[4])
world5 = read_excel(path, sheet=sheets[5])
world6 = read_excel(path, sheet=sheets[6])

In [62]:
world <- bind_rows(world1, world2, world3, world4, world5, world6)
world %>% dim

[1] 12263     3

### 2.5. Joining dataframes

In [63]:
library(dplyr)

In [64]:
math <- data.frame(
    student_id=seq(1, 5),
    maths=c(10, 8, 7, 8.5, 9))

physics <- data.frame(
    student_id=seq(2, 10, 2),
    physics=c(7, 3, 6, 8, 9.5)) %>% mutate(id=student_id)

In [65]:
math

  student_id maths
1 1          10.0
2 2           8.0
3 3           7.0
4 4           8.5
5 5           9.0

In [66]:
physics

  student_id physics id
1  2         7.0      2
2  4         3.0      4
3  6         6.0      6
4  8         8.0      8
5 10         9.5     10

In [67]:
math %>% left_join(physics, by='student_id' )

  student_id maths physics id
1 1          10.0  NA      NA
2 2           8.0   7       2
3 3           7.0  NA      NA
4 4           8.5   3       4
5 5           9.0  NA      NA

In [68]:
math %>% inner_join(physics, by='student_id' )

  student_id maths physics id
1 2          8.0   7       2
2 4          8.5   3       4

In [69]:
math %>% left_join(physics, by=c('student_id'='id'))

  student_id maths student_id.y physics
1 1          10.0  NA           NA
2 2           8.0   2            7
3 3           7.0  NA           NA
4 4           8.5   4            3
5 5           9.0  NA           NA

## Resources
- *r4ds.had.co.nz - [R for Data Science](https://r4ds.had.co.nz/)*